# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\patternagents\PSoC_Workshop\projects\LAB_TWO\LAB_TWO.cydsn\LAB_TWO.cyprj
# Date: Wed, 26 Aug 2015 21:23:51 GMT
#set_units -time ns
create_clock -name {CLK_TIMER_1(FFB)} -period 83333.333333333328 -waveform {0 41666.6666666667} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {CLK_TIMER_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 2001 4001} -nominal_period 83333.333333333328 [list]
create_generated_clock -name {CLK_BREATHE} -source [get_pins {ClockBlock/hfclk}] -edges {1 4801 9601} [list [get_pins {ClockBlock/udb_div_0}]]


# Component constraints for D:\patternagents\PSoC_Workshop\projects\LAB_TWO\LAB_TWO.cydsn\TopDesign\TopDesign.cysch
# Project: D:\patternagents\PSoC_Workshop\projects\LAB_TWO\LAB_TWO.cydsn\LAB_TWO.cyprj
# Date: Wed, 26 Aug 2015 21:23:46 GMT
