# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\patternagents\PSoC_Workshop\projects\LAB_ONE\LAB_ONE.cydsn\LAB_ONE.cyprj
# Date: Wed, 26 Aug 2015 21:20:50 GMT
#set_units -time ns
create_clock -name {Clock_12Khz(FFB)} -period 83333.333333333328 -waveform {0 41666.6666666667} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock_12Khz} -source [get_pins {ClockBlock/hfclk}] -edges {1 4001 8001} -nominal_period 83333.333333333328 [list]


# Component constraints for D:\patternagents\PSoC_Workshop\projects\LAB_ONE\LAB_ONE.cydsn\TopDesign\TopDesign.cysch
# Project: D:\patternagents\PSoC_Workshop\projects\LAB_ONE\LAB_ONE.cydsn\LAB_ONE.cyprj
# Date: Wed, 26 Aug 2015 21:20:47 GMT
