# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\patternagents\PSoC_Workshop\projects\LAB_FOUR\LAB_FOUR.cydsn\LAB_FOUR.cyprj
# Date: Wed, 26 Aug 2015 21:31:57 GMT
#set_units -time ns
create_clock -name {ADC_1_intClock(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {UART_1_SCBCLK(FFB)} -period 729.16666666666663 -waveform {0 364.583333333333} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {CLK_TIMER_1(FFB)} -period 83333.333333333328 -waveform {0 41666.6666666667} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {Clock(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_9}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {ADC_1_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 31 61} [list]
create_generated_clock -name {UART_1_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 35 71} [list]
create_generated_clock -name {CLK_TIMER_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 4001 8001} -nominal_period 83333.333333333328 [list]
create_generated_clock -name {Clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 49 97} [list]


# Component constraints for D:\patternagents\PSoC_Workshop\projects\LAB_FOUR\LAB_FOUR.cydsn\TopDesign\TopDesign.cysch
# Project: D:\patternagents\PSoC_Workshop\projects\LAB_FOUR\LAB_FOUR.cydsn\LAB_FOUR.cyprj
# Date: Wed, 26 Aug 2015 21:31:53 GMT
